test/ahmed_wolfdynamics/system/createPatchDict0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name inlet;

        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (left);

        // If constructFrom = set : name of faceSet
        set f0;
    }

    {
        // Name of new patch
        name outlet;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches (right);
    }

    {
        // Name of new patch
        name side1;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;

        patches (bottom);
    }

    {
        // Name of new patch
        name side2;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;

        patches (top);
    }

    {
        // Name of new patch
        name top1;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;

        patches (front);
    }

    {
        // Name of new patch
        name ground;

        patchInfo
        {
            //type wall;
            type patch;
        }

        constructFrom patches;

        patches (back);
    }



/*
    {
        // Name of new patch
        name ahmed;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches (ahmed);
    }
*/
);

// ************************************************************************* //
